atomvm/AtomVM/src/platforms/stm32/src/lib/i2c_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2026 Paul Guyot <pguyot@kallisys.net>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <stdbool.h>
#include <string.h>

#include "stm32_hal_platform.h"

#include <atom.h>
#include <context.h>
#include <defaultatoms.h>
#include <erl_nif.h>
#include <erl_nif_priv.h>
#include <globalcontext.h>
#include <interop.h>
#include <memory.h>
#include <nifs.h>
#include <term.h>

// #define ENABLE_TRACE
#include <trace.h>

#include "avm_log.h"
#include "stm_sys.h"

#define TAG "i2c_driver"

static ErlNifResourceType *i2c_resource_type;

struct I2CResource
{
    I2C_HandleTypeDef handle;
};

static const AtomStringIntPair gpio_bank_table[] = {
    { ATOM_STR("\x1", "a"), (int) GPIOA },
    { ATOM_STR("\x1", "b"), (int) GPIOB },
    { ATOM_STR("\x1", "c"), (int) GPIOC },
    { ATOM_STR("\x1", "d"), (int) GPIOD },
    { ATOM_STR("\x1", "e"), (int) GPIOE },
#ifdef GPIOF
    { ATOM_STR("\x1", "f"), (int) GPIOF },
#endif
#ifdef GPIOG
    { ATOM_STR("\x1", "g"), (int) GPIOG },
#endif
#ifdef GPIOH
    { ATOM_STR("\x1", "h"), (int) GPIOH },
#endif
#ifdef GPIOI
    { ATOM_STR("\x1", "i"), (int) GPIOI },
#endif
#ifdef GPIOJ
    { ATOM_STR("\x1", "j"), (int) GPIOJ },
#endif
#ifdef GPIOK
    { ATOM_STR("\x1", "k"), (int) GPIOK },
#endif
    SELECT_INT_DEFAULT(0)
};

static term create_pair(Context *ctx, term term1, term term2)
{
    term ret = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(ret, 0, term1);
    term_put_tuple_element(ret, 1, term2);
    return ret;
}

static I2C_TypeDef *peripheral_to_instance(int peripheral)
{
    switch (peripheral) {
#ifdef I2C1
        case 1:
            return I2C1;
#endif
#ifdef I2C2
        case 2:
            return I2C2;
#endif
#ifdef I2C3
        case 3:
            return I2C3;
#endif
#ifdef I2C4
        case 4:
            return I2C4;
#endif
        default:
            return NULL;
    }
}

static void enable_i2c_clock(int peripheral)
{
    switch (peripheral) {
#ifdef I2C1
        case 1:
            __HAL_RCC_I2C1_CLK_ENABLE();
            break;
#endif
#ifdef I2C2
        case 2:
            __HAL_RCC_I2C2_CLK_ENABLE();
            break;
#endif
#ifdef I2C3
        case 3:
            __HAL_RCC_I2C3_CLK_ENABLE();
            break;
#endif
#ifdef I2C4
        case 4:
            __HAL_RCC_I2C4_CLK_ENABLE();
            break;
#endif
        default:
            break;
    }
}

static bool get_i2c_resource(Context *ctx, term resource_term, struct I2CResource **rsrc_obj)
{
    void *rsrc_obj_ptr;
    if (UNLIKELY(!enif_get_resource(erl_nif_env_from_context(ctx), resource_term, i2c_resource_type, &rsrc_obj_ptr))) {
        return false;
    }
    *rsrc_obj = (struct I2CResource *) rsrc_obj_ptr;
    return true;
}

static bool get_timeout_ms(term timeout_term, uint32_t *out)
{
    if (term_is_atom(timeout_term)) {
        if (timeout_term == INFINITY_ATOM) {
            *out = HAL_MAX_DELAY;
            return true;
        }
        return false;
    }
    if (!term_is_integer(timeout_term)) {
        return false;
    }
    avm_int_t val = term_to_int(timeout_term);
    if (val < 0) {
        return false;
    }
    *out = (uint32_t) val;
    return true;
}

/*
 * I2C timing computation.
 * F2/F4 use the legacy I2C peripheral (ClockSpeed/DutyCycle).
 * All other supported families use the newer I2C with a Timing register.
 */
#if defined(STM32F2XX) || defined(STM32F4XX)

static void configure_i2c_timing(I2C_HandleTypeDef *handle, uint32_t clock_speed_hz)
{
    handle->Init.ClockSpeed = clock_speed_hz;
    handle->Init.DutyCycle = I2C_DUTYCYCLE_2;
}

#else

/*
 * Compute a Timing register value for a target I2C baudrate.
 * This is a simplified computation assuming analog filter on, digital filter off.
 * For production use, STM32CubeMX-generated values are recommended.
 */
static uint32_t compute_i2c_timing(uint32_t pclk_freq, uint32_t target_freq)
{
    uint32_t presc, scll, sclh;

    if (target_freq <= 100000) {
        /* Standard mode (100 kHz) */
        presc = (pclk_freq / 4000000) - 1;
        if (presc > 15) {
            presc = 15;
        }
        uint32_t t_presc = pclk_freq / (presc + 1);
        uint32_t scl_period = t_presc / target_freq;
        scll = scl_period / 2;
        sclh = scl_period - scll;
        if (scll > 0) {
            scll--;
        }
        if (sclh > 0) {
            sclh--;
        }
        if (scll > 255) {
            scll = 255;
        }
        if (sclh > 255) {
            sclh = 255;
        }
    } else {
        /* Fast mode (400 kHz) */
        presc = (pclk_freq / 8000000) - 1;
        if (presc > 15) {
            presc = 15;
        }
        uint32_t t_presc = pclk_freq / (presc + 1);
        uint32_t scl_period = t_presc / target_freq;
        scll = (scl_period * 2) / 3;
        sclh = scl_period - scll;
        if (scll > 0) {
            scll--;
        }
        if (sclh > 0) {
            sclh--;
        }
        if (scll > 255) {
            scll = 255;
        }
        if (sclh > 255) {
            sclh = 255;
        }
    }

    /* SDADEL and SCLDEL: use safe conservative values */
    uint32_t sdadel = 2;
    uint32_t scldel = 4;

    return (presc << 28) | (scldel << 20) | (sdadel << 16) | (sclh << 8) | scll;
}

static void configure_i2c_timing(I2C_HandleTypeDef *handle, uint32_t clock_speed_hz)
{
    uint32_t pclk1_freq = HAL_RCC_GetPCLK1Freq();
    handle->Init.Timing = compute_i2c_timing(pclk1_freq, clock_speed_hz);
}

#endif

static bool parse_pin(GlobalContext *glb, term pin_term, GPIO_TypeDef **port, uint16_t *pin_mask)
{
    if (!term_is_tuple(pin_term) || term_get_tuple_arity(pin_term) != 2) {
        return false;
    }
    term bank_atom = term_get_tuple_element(pin_term, 0);
    if (!term_is_atom(bank_atom)) {
        return false;
    }
    uint32_t gpio_bank = (uint32_t) interop_atom_term_select_int(gpio_bank_table, bank_atom, glb);
    if (gpio_bank == 0) {
        return false;
    }
    *port = (GPIO_TypeDef *) gpio_bank;

    term pin_num_term = term_get_tuple_element(pin_term, 1);
    if (!term_is_integer(pin_num_term)) {
        return false;
    }
    int pin_num = term_to_int(pin_num_term);
    if (pin_num < 0 || pin_num > 15) {
        return false;
    }
    *pin_mask = (uint16_t) (1U << pin_num);
    return true;
}

