atomvm/AtomVM/src/platforms/stm32/src/lib/i2c_driver.c
static term nif_i2c_init(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);
    term opts = argv[0];
    VALIDATE_VALUE(opts, term_is_list);

    static const char *const peripheral_str = ATOM_STR("\xA", "peripheral");
    static const char *const scl_str = ATOM_STR("\x3", "scl");
    static const char *const sda_str = ATOM_STR("\x3", "sda");
    static const char *const clock_speed_hz_str = ATOM_STR("\xE", "clock_speed_hz");
    static const char *const af_str = ATOM_STR("\x2", "af");
    static const char *const own_address_str = ATOM_STR("\xB", "own_address");

    GlobalContext *glb = ctx->global;

    term peripheral_term = interop_kv_get_value_default(opts, peripheral_str, term_from_int(1), glb);
    term scl_term = interop_kv_get_value(opts, scl_str, glb);
    term sda_term = interop_kv_get_value(opts, sda_str, glb);
    term clock_speed_term = interop_kv_get_value_default(opts, clock_speed_hz_str, term_from_int(100000), glb);
    term af_term = interop_kv_get_value_default(opts, af_str, term_from_int(4), glb);
    term own_address_term = interop_kv_get_value_default(opts, own_address_str, term_from_int(0), glb);

    if (term_is_invalid_term(scl_term) || term_is_invalid_term(sda_term)) {
        AVM_LOGE(TAG, "scl and sda pins are required");
        RAISE_ERROR(BADARG_ATOM);
    }

    VALIDATE_VALUE(peripheral_term, term_is_integer);
    VALIDATE_VALUE(clock_speed_term, term_is_integer);
    VALIDATE_VALUE(af_term, term_is_integer);
    VALIDATE_VALUE(own_address_term, term_is_integer);

    int peripheral = term_to_int(peripheral_term);
    uint32_t clock_speed_hz = (uint32_t) term_to_int(clock_speed_term);
    uint32_t af = (uint32_t) term_to_int(af_term);

    if (UNLIKELY(clock_speed_hz == 0)) {
        AVM_LOGE(TAG, "clock_speed_hz must be > 0");
        RAISE_ERROR(BADARG_ATOM);
    }

    I2C_TypeDef *instance = peripheral_to_instance(peripheral);
    if (IS_NULL_PTR(instance)) {
        AVM_LOGE(TAG, "Invalid I2C peripheral: %d", peripheral);
        RAISE_ERROR(BADARG_ATOM);
    }

    GPIO_TypeDef *scl_port;
    uint16_t scl_pin;
    if (!parse_pin(glb, scl_term, &scl_port, &scl_pin)) {
        AVM_LOGE(TAG, "Invalid SCL pin");
        RAISE_ERROR(BADARG_ATOM);
    }

    GPIO_TypeDef *sda_port;
    uint16_t sda_pin;
    if (!parse_pin(glb, sda_term, &sda_port, &sda_pin)) {
        AVM_LOGE(TAG, "Invalid SDA pin");
        RAISE_ERROR(BADARG_ATOM);
    }

    enable_i2c_clock(peripheral);

    GPIO_InitTypeDef gpio_init = { 0 };
    gpio_init.Mode = GPIO_MODE_AF_OD;
    gpio_init.Pull = GPIO_PULLUP;
    gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio_init.Alternate = af;

    gpio_init.Pin = scl_pin;
    HAL_GPIO_Init(scl_port, &gpio_init);

    gpio_init.Pin = sda_pin;
    HAL_GPIO_Init(sda_port, &gpio_init);

    struct I2CResource *rsrc_obj = enif_alloc_resource(i2c_resource_type, sizeof(struct I2CResource));
    if (IS_NULL_PTR(rsrc_obj)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }

    memset(&rsrc_obj->handle, 0, sizeof(I2C_HandleTypeDef));
    rsrc_obj->handle.Instance = instance;
    configure_i2c_timing(&rsrc_obj->handle, clock_speed_hz);
    rsrc_obj->handle.Init.OwnAddress1 = (uint32_t) (term_to_int(own_address_term) << 1);
    rsrc_obj->handle.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    rsrc_obj->handle.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    rsrc_obj->handle.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    rsrc_obj->handle.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

    HAL_StatusTypeDef status = HAL_I2C_Init(&rsrc_obj->handle);
    if (status != HAL_OK) {
        enif_release_resource(rsrc_obj);
        AVM_LOGE(TAG, "HAL_I2C_Init failed: %d", (int) status);
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return create_pair(ctx, ERROR_ATOM, globalcontext_make_atom(glb, ATOM_STR("\x8", "i2c_init")));
    }

    if (UNLIKELY(memory_ensure_free(ctx, TERM_BOXED_RESOURCE_SIZE) != MEMORY_GC_OK)) {
        HAL_I2C_DeInit(&rsrc_obj->handle);
        enif_release_resource(rsrc_obj);
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term obj = term_from_resource(rsrc_obj, &ctx->heap);
    enif_release_resource(rsrc_obj);

    if (UNLIKELY(memory_ensure_free_with_roots(ctx, TUPLE_SIZE(2), 1, &obj, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }

    return create_pair(ctx, OK_ATOM, obj);
}

static term nif_i2c_deinit(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!get_i2c_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }

    if (IS_NULL_PTR(rsrc_obj->handle.Instance)) {
        return OK_ATOM;
    }
    HAL_I2C_DeInit(&rsrc_obj->handle);
    rsrc_obj->handle.Instance = NULL;

    return OK_ATOM;
}

static term hal_status_to_error(Context *ctx, HAL_StatusTypeDef status)
{
    switch (status) {
        case HAL_TIMEOUT:
            return create_pair(ctx, ERROR_ATOM, TIMEOUT_ATOM);
        case HAL_BUSY:
            return create_pair(ctx, ERROR_ATOM, globalcontext_make_atom(ctx->global, ATOM_STR("\x4", "busy")));
        default:
            return create_pair(ctx, ERROR_ATOM, globalcontext_make_atom(ctx->global, ATOM_STR("\x3", "eio")));
    }
}

static term nif_i2c_master_transmit(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!get_i2c_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    VALIDATE_VALUE(argv[1], term_is_integer);
    VALIDATE_VALUE(argv[2], term_is_binary);

    /* HAL expects 8-bit address (7-bit address left-shifted by 1) */
    uint16_t addr = (uint16_t) (term_to_int(argv[1]) << 1);
    const uint8_t *data = (const uint8_t *) term_binary_data(argv[2]);
    size_t len = term_binary_size(argv[2]);
    uint32_t timeout_ms;
    if (UNLIKELY(!get_timeout_ms(argv[3], &timeout_ms))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    if (UNLIKELY(len > UINT16_MAX)) {
        RAISE_ERROR(BADARG_ATOM);
    }

    HAL_StatusTypeDef status = HAL_I2C_Master_Transmit(&rsrc_obj->handle, addr, (uint8_t *) data, (uint16_t) len, timeout_ms);
    if (UNLIKELY(status != HAL_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return hal_status_to_error(ctx, status);
    }

    return term_from_int((int) len);
}

static term nif_i2c_master_receive(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

