atomvm/AtomVM/src/platforms/stm32/src/lib/i2c_driver.c
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!get_i2c_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    VALIDATE_VALUE(argv[1], term_is_integer);
    VALIDATE_VALUE(argv[2], term_is_integer);

    uint16_t addr = (uint16_t) (term_to_int(argv[1]) << 1);
    avm_int_t count = term_to_int(argv[2]);
    uint32_t timeout_ms;
    if (UNLIKELY(!get_timeout_ms(argv[3], &timeout_ms))) {
        RAISE_ERROR(BADARG_ATOM);
    }

    if (UNLIKELY(count < 0 || count > UINT16_MAX)) {
        RAISE_ERROR(BADARG_ATOM);
    }

    if (UNLIKELY(memory_ensure_free_opt(ctx, TUPLE_SIZE(2) + term_binary_heap_size(count), MEMORY_NO_GC) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term data = term_create_uninitialized_binary(count, &ctx->heap, ctx->global);
    uint8_t *buf = (uint8_t *) term_binary_data(data);

    HAL_StatusTypeDef status = HAL_I2C_Master_Receive(&rsrc_obj->handle, addr, buf, (uint16_t) count, timeout_ms);
    if (UNLIKELY(status != HAL_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return hal_status_to_error(ctx, status);
    }

    return create_pair(ctx, OK_ATOM, data);
}

static bool get_mem_add_size(term mem_add_size_term, uint16_t *out)
{
    avm_int_t val = term_to_int(mem_add_size_term);
    if (val == 16) {
        *out = I2C_MEMADD_SIZE_16BIT;
        return true;
    }
    if (val == 8) {
        *out = I2C_MEMADD_SIZE_8BIT;
        return true;
    }
    return false;
}

static term nif_i2c_mem_read(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!get_i2c_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    VALIDATE_VALUE(argv[1], term_is_integer);
    VALIDATE_VALUE(argv[2], term_is_integer);
    VALIDATE_VALUE(argv[3], term_is_integer);
    VALIDATE_VALUE(argv[4], term_is_integer);

    /* HAL expects 8-bit address (7-bit address left-shifted by 1) */
    uint16_t addr = (uint16_t) (term_to_int(argv[1]) << 1);
    uint16_t mem_addr = (uint16_t) term_to_int(argv[2]);
    uint16_t mem_addr_size;
    if (UNLIKELY(!get_mem_add_size(argv[3], &mem_addr_size))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    avm_int_t count = term_to_int(argv[4]);
    uint32_t timeout_ms;
    if (UNLIKELY(!get_timeout_ms(argv[5], &timeout_ms))) {
        RAISE_ERROR(BADARG_ATOM);
    }

    if (UNLIKELY(count < 0 || count > UINT16_MAX)) {
        RAISE_ERROR(BADARG_ATOM);
    }

    if (UNLIKELY(memory_ensure_free_opt(ctx, TUPLE_SIZE(2) + term_binary_heap_size(count), MEMORY_NO_GC) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term data = term_create_uninitialized_binary(count, &ctx->heap, ctx->global);
    uint8_t *buf = (uint8_t *) term_binary_data(data);

    HAL_StatusTypeDef status = HAL_I2C_Mem_Read(&rsrc_obj->handle, addr, mem_addr, mem_addr_size, buf, (uint16_t) count, timeout_ms);
    if (UNLIKELY(status != HAL_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return hal_status_to_error(ctx, status);
    }

    return create_pair(ctx, OK_ATOM, data);
}

static term nif_i2c_mem_write(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!get_i2c_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    VALIDATE_VALUE(argv[1], term_is_integer);
    VALIDATE_VALUE(argv[2], term_is_integer);
    VALIDATE_VALUE(argv[3], term_is_integer);
    VALIDATE_VALUE(argv[4], term_is_binary);

    /* HAL expects 8-bit address (7-bit address left-shifted by 1) */
    uint16_t addr = (uint16_t) (term_to_int(argv[1]) << 1);
    uint16_t mem_addr = (uint16_t) term_to_int(argv[2]);
    uint16_t mem_addr_size;
    if (UNLIKELY(!get_mem_add_size(argv[3], &mem_addr_size))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    const uint8_t *data = (const uint8_t *) term_binary_data(argv[4]);
    size_t len = term_binary_size(argv[4]);
    uint32_t timeout_ms;
    if (UNLIKELY(!get_timeout_ms(argv[5], &timeout_ms))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    if (UNLIKELY(len > UINT16_MAX)) {
        RAISE_ERROR(BADARG_ATOM);
    }

    HAL_StatusTypeDef status = HAL_I2C_Mem_Write(&rsrc_obj->handle, addr, mem_addr, mem_addr_size, (uint8_t *) data, (uint16_t) len, timeout_ms);
    if (UNLIKELY(status != HAL_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return hal_status_to_error(ctx, status);
    }

    return term_from_int((int) len);
}

static term nif_i2c_is_device_ready(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!get_i2c_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    VALIDATE_VALUE(argv[1], term_is_integer);
    VALIDATE_VALUE(argv[2], term_is_integer);

    uint16_t addr = (uint16_t) (term_to_int(argv[1]) << 1);
    uint32_t trials = (uint32_t) term_to_int(argv[2]);
    uint32_t timeout_ms;
    if (UNLIKELY(!get_timeout_ms(argv[3], &timeout_ms))) {
        RAISE_ERROR(BADARG_ATOM);
    }

    HAL_StatusTypeDef status = HAL_I2C_IsDeviceReady(&rsrc_obj->handle, addr, trials, timeout_ms);
    if (UNLIKELY(status != HAL_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return hal_status_to_error(ctx, status);
    }

    return OK_ATOM;
}

static term nif_i2c_slave_transmit(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!get_i2c_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    VALIDATE_VALUE(argv[1], term_is_binary);

    const uint8_t *data = (const uint8_t *) term_binary_data(argv[1]);
    size_t len = term_binary_size(argv[1]);
    uint32_t timeout_ms;
    if (UNLIKELY(!get_timeout_ms(argv[2], &timeout_ms))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    if (UNLIKELY(len > UINT16_MAX)) {
        RAISE_ERROR(BADARG_ATOM);
    }

    HAL_StatusTypeDef status = HAL_I2C_Slave_Transmit(&rsrc_obj->handle, (uint8_t *) data, (uint16_t) len, timeout_ms);
    if (UNLIKELY(status != HAL_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return hal_status_to_error(ctx, status);
    }

    return term_from_int((int) len);
}

static term nif_i2c_slave_receive(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

