atomvm/AtomVM/src/platforms/stm32/src/lib/i2c_driver.c
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!get_i2c_resource(ctx, argv[0], &rsrc_obj))) {
        RAISE_ERROR(BADARG_ATOM);
    }
    VALIDATE_VALUE(argv[1], term_is_integer);

    avm_int_t count = term_to_int(argv[1]);
    uint32_t timeout_ms;
    if (UNLIKELY(!get_timeout_ms(argv[2], &timeout_ms))) {
        RAISE_ERROR(BADARG_ATOM);
    }

    if (UNLIKELY(count < 0 || count > UINT16_MAX)) {
        RAISE_ERROR(BADARG_ATOM);
    }

    if (UNLIKELY(memory_ensure_free_opt(ctx, TUPLE_SIZE(2) + term_binary_heap_size(count), MEMORY_NO_GC) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term data = term_create_uninitialized_binary(count, &ctx->heap, ctx->global);
    uint8_t *buf = (uint8_t *) term_binary_data(data);

    HAL_StatusTypeDef status = HAL_I2C_Slave_Receive(&rsrc_obj->handle, buf, (uint16_t) count, timeout_ms);
    if (UNLIKELY(status != HAL_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        return hal_status_to_error(ctx, status);
    }

    return create_pair(ctx, OK_ATOM, data);
}

static void i2c_resource_dtor(ErlNifEnv *caller_env, void *obj)
{
    UNUSED(caller_env);
    struct I2CResource *rsrc_obj = (struct I2CResource *) obj;
    if (!IS_NULL_PTR(rsrc_obj->handle.Instance)) {
        HAL_I2C_DeInit(&rsrc_obj->handle);
        rsrc_obj->handle.Instance = NULL;
    }
}

static const ErlNifResourceTypeInit I2CResourceTypeInit = {
    .members = 1,
    .dtor = i2c_resource_dtor,
};

static const struct Nif i2c_init_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_init
};
static const struct Nif i2c_deinit_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_deinit
};
static const struct Nif i2c_master_transmit_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_master_transmit
};
static const struct Nif i2c_master_receive_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_master_receive
};
static const struct Nif i2c_mem_read_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_mem_read
};
static const struct Nif i2c_mem_write_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_mem_write
};
static const struct Nif i2c_is_device_ready_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_is_device_ready
};
static const struct Nif i2c_slave_transmit_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_slave_transmit
};
static const struct Nif i2c_slave_receive_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_i2c_slave_receive
};

static void i2c_nif_init(GlobalContext *global)
{
    ErlNifEnv env;
    erl_nif_env_partial_init_from_globalcontext(&env, global);
    i2c_resource_type = enif_init_resource_type(&env, "i2c_resource", &I2CResourceTypeInit, ERL_NIF_RT_CREATE, NULL);
}

static const struct Nif *i2c_nif_get_nif(const char *nifname)
{
    if (strncmp("i2c:", nifname, 4) != 0) {
        return NULL;
    }
    const char *rest = nifname + 4;
    if (strcmp("init/1", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_init_nif;
    }
    if (strcmp("deinit/1", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_deinit_nif;
    }
    if (strcmp("master_transmit/4", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_master_transmit_nif;
    }
    if (strcmp("master_receive/4", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_master_receive_nif;
    }
    if (strcmp("mem_read/6", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_mem_read_nif;
    }
    if (strcmp("mem_write/6", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_mem_write_nif;
    }
    if (strcmp("is_device_ready/4", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_is_device_ready_nif;
    }
    if (strcmp("slave_transmit/3", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_slave_transmit_nif;
    }
    if (strcmp("slave_receive/3", rest) == 0) {
        TRACE("Resolved i2c nif %s ...\n", nifname);
        return &i2c_slave_receive_nif;
    }
    return NULL;
}

REGISTER_NIF_COLLECTION(i2c, i2c_nif_init, NULL, i2c_nif_get_nif)
